# SteelElementProperties Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
SteelElementProperties Members
SteelElementProperties Class Methods Properties See Also
---
The SteelElementProperties type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddFabricationInformationForRevitElements | This method adds fabrication information to the given elements. |
| Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from APIObject.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetFabricationUniqueID | This method will return the fabrication id for the given reference. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetReference | This method will return the reference for the given fabrication id. |
| GetSteelElementProperties | Get SteelElementProperties for the input element if they exist. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from APIObject.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| UniqueID | This method will return the fabrication id. This represents the link between the Revit and the Steel Core element. |

# See Also
SteelElementProperties Class
Autodesk.Revit.DB.Steel Namespace